{
    "about": {
        "sectionTitle": "About Me",
        "sectionTitleWaterText": "About Me",
        "aboutMe": "Driven by curiosity, tech innovation is pushing our world forward at an unprecedented rate. I am a Computer Scientist with a passion for software, innovation and people.",
        "aboutMe2": "Starting computer science in high school, I focused on Java and SQL database programming. Reading my undergraduate, I took up a focus in software engineering, AI, user interaction and data visualisation. I aim to utilise these areas to make people's life better (more comfortable, happier, more powerful, and more efficient) with technology. ",
        "aboutMe3": "Recently I finished reading an MSc in Software System Engineering so that I can reinforce the fundamentals of software engineering, requirement engineering, software architecture, project management in software and the core of software systems design. I plan to dive into the industry with an expert background in SSE with a passion for innovation, technology, and people.",
        "aboutMe4": "I am now working as a backend engineer at Marshmallow Insurance, a rapidly growing startup that enforces reliabilty, dilengence, fast results and bleeding-edge thinking in its values."
     },
    "socials": [
        {
            "icon": "fa fa-facebook",
            "link": "https://www.facebook.com/svenstr/"
        },
        {
            "icon": "fa fa-twitter",
            "link": "https://www.twitter.com/SvenFinlayson"
        },
        {
            "icon": "fa fa-linkedin",
            "link": "https://www.linkedin.com/in/svensfinlay/"
        },
        {
            "icon": "fa fa-instagram",
            "link": "https://www.instagram.com/svenstr_finlay/?hl=en"
        },
        {
            "icon": "fa fa-github",
            "link": "https://github.com/SvenStruanFinlay"
        }
    ],
    "aboutDetails": {
        "image": "/img/smart.png",
        "heading": "I'm Sven Finlay, <br>Software System Engineer, Developer, Architect and Designer",
        "infoList": [
            {
                "label": "Name",
                "info": "Sven Struan Finlay"
            },
            {
                "label": "Email",
                "info": "info@svensfinlay.tech"
            },
            {
                "label": "Skype",
                "info": "svenstr.finlay"
            },
            {
                "label": "Website",
                "info": "www.svensfinlay.tech"
            },
            {
                "label": "Job",
                "info": "Software System Engineer"
            },
            {
                "label": "Phone",
                "info": "At request"
            },
            {
                "label": "Address",
                "info": "Zone 1, London"
            },
            {
                "label": "Nationality",
                "info": "Irish and South African"
            }
        ]
    }
}