{
    "sectionTitle": "My Resume",
    "sectionTitleWaterText": "My Resume",
    "education": {
        "heading": "Education",
        "resumes": [
            {
                "insName": "UCL - Distinction",
                "position": "<span>2019/20</span> | MSc Software Systems Engineering",
                "desc": "Modules: Tools and Environments, Requirements Engineering and Software Architec-ture, Professional Practice, Software Abstractions and Systems Integration, People and Security, Validation and Verification & Multi-agent Artificial Intelligence."
            },
            {
                "insName": "University of St Andrews - First Class ",
                "position": "<span>2015-2019</span> | BSc Computer Science (Hons)",
                "desc": "HighAchievementModules:Software Engineering Practice, Constraint Programming, Information Visualisation and Visual Analytics, Logic and Software Verification, Artificial Intelligence Prac-tice, Video Games, and Software Engineering Team Project."
            },
            {
                "insName": "SACS High",
                "position": "<span>2010-2014</span> | High School diploma A level Equivalent.",
                "desc": "NSC RSA (A Levels Equivalent): Mathematics, Physics, Chemistry, Information technology, Music, English and Afrikaans"
            }
        ]
    },
    "professional": {
        "heading": "Professional",
        "resumes": [
            {
                "insName": "Marshmallow",
                "position": "<span>April 2021 - Present</span> | Backend Engineer Level 2",
                "desc": "Working in the Effeiency team, a core team that focuses on automation and optimisation. Focusing on payments, customer self service and task automation."
            },
            {
                "insName": "Erika Security",
                "position": "<span>Jan 2021 - April 2021</span> | Full Stack Engineer - Part Time",
                "desc": "I was working on a flexible part-time contract to design and implement a foundational system for a new security startup. I successfully integrated quickly and made a significant contribution in the short time I was there. "
            },
            {
                "insName": "Medidata",
                "position": "<span>Summer 2019 </span> |  Innovation Scientist - Intern",
                "desc": "Worked in a team of clinical trial experts developing new innovative ideas for the company. Developed a proof-of-concept (PoC) system integrating 3D printing into the medical supply system. Rapidly adapted to understanding of clinical trials and its software systems to develop PoC. Cross-functional teamwork, python, agile development, system design and project management."
            },
            {
                "insName": "The Saint - St Andrews Student Newspaper",
                "position": "<span>2018-2019</span> |  Web Editor",
                "desc": " Oversaw the now award-winning website redesign while managing and growing the team."
            },
            {
                "insName": "University of St Andrews",
                "position": "<span>Summer 2018</span> | Research Intern",
                "desc": "Wrote software in MATLAB to solve classification issues with medical data for the NHS."
            },
            {
                "insName": "Code First: Girls",
                "position": "<span>2018-2019</span> |  Assistant Instructor ",
                "desc": "Assistant instructor for the python course with a focus on back end web development."
            }
        ]
    },
    "Publicaitons": {
        "heading": "Publicaitons",
        "resumes": [
            {
                "insName": "Intel Sight++",
                "position": "<span>GOSH Conference 2020</span> |  INTEL UCL IXN - TEAM LEAD",
                "desc": "Finlay S, Visram S, Georgsson G, et al 49 Sight ++: Prototyping a computer vision guidedassistive technology. Archives of Disease in Childhood 2020;105:A17. https://adc.bmj.com/content/105/Suppl_2/A17.1"
            }            
        ]
    }
}
